OpenFOAM-2.3.0/tutorials/combustion/fireFoam/les/oppositeBurningPanels/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    ground
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    top
    {
        type            zeroGradient;
        value           $internalField;
    }

    burner
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    sides
    {
        type            totalPressure;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           1.4;
        p0              $internalField;
        value           $internalField;
    }

    "(region0_to.*)"
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
}


// ************************************************************************* //
